app/controllers/airplanes_controller.rb

SELECT "airplanes".* FROM "airplanes"
---
  def index
    @airplanes = Airplane.all

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_airplane
      @airplane = Airplane.find(params[:id])