app/controllers/flights_controller.rb

  def create
    @flight = Flight.new(flight_params)

    respond_to do |format|
      if @flight.save
---
INSERT INTO "flights" ("flightTime", "source", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["flightTime", "2023-11-06 00:00:00"], ["source", "2023-11-06"], ["created_at", "2018-04-19 03:56:37.364286"], ["updated_at", "2018-04-19 03:56:37.364286"]]

  def destroy
    @flight.destroy
---
DELETE FROM "flights" WHERE "flights"."id" = $1  [["id", 43]]